docs: update design for missing right sensor
